app/src/main/assets/registryStoredQuery.mustache

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
	<soap:Header xmlns:addr="http://www.w3.org/2005/08/addressing">
		<addr:Action soap:mustUnderstand="1">urn:ihe:iti:2007:RegistryStoredQuery</addr:Action>
		<addr:MessageID>{{MESSAGE_UUID}}</addr:MessageID>
	</soap:Header>
	<soap:Body>
		<query:AdhocQueryRequest xmlns:query="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
			<query:ResponseOption returnComposedObjects="true" returnType="LeafClass"/>
			<rim:AdhocQuery id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d">

				<rim:Slot name="$XDSDocumentEntryPatientId">
					<rim:ValueList>
						<rim:Value>'{{PATIENT_ID}}'</rim:Value>
						<!-- <rim:Value>'1^^^&amp;1.3.6.1.4.1.21367.2005.3.7&amp;ISO'</rim:Value> -->		
					</rim:ValueList>
				</rim:Slot>
                <rim:Slot name="$XDSDocumentEntryStatus">
                    <rim:ValueList>
                        <rim:Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved')</rim:Value>
                    </rim:ValueList>
				</rim:Slot>

                <rim:Slot name="$XDSDocumentEntryFormatCode">
					<rim:ValueList>
						<rim:Value>('{{DOCUMENT_FORMAT_CODE_NODE_REPRESENTATION}}^^{{DOCUMENT_FORMAT_CODE_SYSTEM}}')</rim:Value>
						<!-- <rim:Value>('urn:fhg:fokus:fc:bz:2018^^1.2.276.0.76.3.1.158.9999.1')</rim:Value> -->
						<!-- <rim:Value>('urn:fhg:fokus:fc:ge:2018^^1.2.276.0.76.3.1.158.9999.1')</rim:Value> -->
						<!-- <rim:Value>('urn:fhg:fokus:fc:hba1c:2018^^1.2.276.0.76.3.1.158.9999.1')</rim:Value> -->
					</rim:ValueList>
				</rim:Slot>

			</rim:AdhocQuery>
		</query:AdhocQueryRequest>
	</soap:Body>
</soap:Envelope>